In [1]:
import pandas as pd
import numpy as np

In [2]:
raw_data_1 = {
        'subject_id': ['1', '2', '3', '4', '5'],
        'first_name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'], 
        'last_name': ['Anderson', 'Ackerman', 'Ali', 'Aoni', 'Atiches']}

raw_data_2 = {
        'subject_id': ['4', '5', '6', '7', '8'],
        'first_name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'], 
        'last_name': ['Bonder', 'Black', 'Balwner', 'Brice', 'Btisan']}

raw_data_3 = {
        'subject_id': ['1', '2', '3', '4', '5', '7', '8', '9', '10', '11'],
        'test_id': ['51', '15', '15', '61', '16', '14', '15', '1', '61', '16']}

In [11]:
data1=pd.DataFrame(raw_data_1)
data2=pd.DataFrame(raw_data_2)
data3=pd.DataFrame(raw_data_3)

In [23]:
frames=[data1,data2]
all_data=pd.concat(frames)

In [25]:
all_data.reset_index(drop=True,inplace=True)

In [27]:
all_data_col=pd.concat(frames,axis=1)
all_data_col

  subject_id first_name last_name subject_id first_name last_name
0          1       Alex  Anderson          4      Billy    Bonder
1          2        Amy  Ackerman          5      Brian     Black
2          3      Allen       Ali          6       Bran   Balwner
3          4      Alice      Aoni          7      Bryce     Brice
4          5     Ayoung   Atiches          8      Betty    Btisan

In [30]:
dfrmerge=pd.merge(all_data,data3,on='subject_id')
dfrmerge

  subject_id first_name last_name test_id
0          1       Alex  Anderson      51
1          2        Amy  Ackerman      15
2          3      Allen       Ali      15
3          4      Alice      Aoni      61
4          4      Billy    Bonder      61
5          5     Ayoung   Atiches      16
6          5      Brian     Black      16
7          7      Bryce     Brice      14
8          8      Betty    Btisan      15

In [33]:
pd.merge(data1,data2,on='subject_id',how='inner')

  subject_id first_name_x last_name_x first_name_y last_name_y
0          4        Alice        Aoni        Billy      Bonder
1          5       Ayoung     Atiches        Brian       Black

In [35]:
pd.merge(data1,data2,on='subject_id',how='inner')

  subject_id first_name_x last_name_x first_name_y last_name_y
0          4        Alice        Aoni        Billy      Bonder
1          5       Ayoung     Atiches        Brian       Black